; domain
;; domain.pddl
;; Dominio PDDL per la quest "Il Sorriso Perduto di Pipo"
(define (domain sorriso-perduto-di-pipo)
  (:requirements :strips :typing :negative-preconditions) ;; Requisiti base per Fast Downward

  ;; Definizione dei tipi per gli elementi del mondo
  (:types
    personaggio ;; Tipo generico per i personaggi
    luogo ;; Tipo per le location del mondo
    oggetto_magico ;; Tipo per gli oggetti magici
    pipo - personaggio ;; Pipo e un tipo speciale di personaggio
    fiore - oggetto_magico ;; Il Fiore che Ride e un tipo speciale di oggetto
  )

  ;; Predicati che descrivono lo stato del mondo
  (:predicates
    (at ?p - pipo ?l - luogo) ;; Indica la posizione attuale di Pipo
    (flower-at ?f - fiore ?l - luogo) ;; Indica la posizione del Fiore che Ride
    (pipo-has-lost-touch) ;; Stato iniziale: Pipo ha perso il suo tocco comico
    (circus-is-saved) ;; Stato finale: il circo e salvo
    (guardian-blocks-bridge) ;; Il Guardiano Brontolone blocca il ponte
    (labyrinth-is-confusing) ;; Il labirinto confonde il percorso
    (mime-is-sabotaging) ;; Il Mimo Silente sta attivamente sabotando
    (melody-is-sad) ;; La melodia malinconica e attiva
    (pipo-has-flower ?f - fiore) ;; Pipo ha raccolto il Fiore che Ride
    (pipo-is-focused) ;; Pipo ha superato i suoi dubbi e puo resistere alla tristezza
    (path-is-clear ?from - luogo ?to - luogo) ;; Indica che un percorso tra due luoghi e libero
  )

  ;; --- AZIONI POSSIBILI ---

  ;; Azione per muoversi tra due luoghi collegati e sicuri
  (:action move
    :parameters (?p - pipo ?from - luogo ?to - luogo) ;; Pipo si muove da un luogo all'altro
    :precondition (and
      (at ?p ?from) ;; Pipo deve essere nel luogo di partenza
      (path-is-clear ?from ?to) ;; Il percorso tra i due luoghi deve essere libero
    )
    :effect (and
      (not (at ?p ?from)) ;; Pipo non e piu nel luogo di partenza
      (at ?p ?to) ;; Pipo e ora nel luogo di destinazione
    )
  )

  ;; Azione per superare il Guardiano Brontolone
  (:action make-guardian-laugh
    :parameters (?p - pipo ?l - luogo) ;; Pipo affronta il guardiano in un certo luogo
    :precondition (and
      (at ?p ?l) ;; Pipo deve essere nella stessa location del guardiano
      (guardian-blocks-bridge) ;; Il guardiano deve bloccare il ponte
    )
    :effect (and
      (not (guardian-blocks-bridge)) ;; Il guardiano non blocca piu il ponte
    )
  )

  ;; Azione per superare il Labirinto degli Specchi
  (:action navigate-labyrinth
    :parameters (?p - pipo ?l - luogo) ;; Pipo affronta il labirinto
    :precondition (and
      (at ?p ?l) ;; Pipo deve essere nel labirinto
      (labyrinth-is-confusing) ;; Il labirinto deve essere un ostacolo
    )
    :effect (and
      (not (labyrinth-is-confusing)) ;; Il labirinto non e piu un ostacolo
      (pipo-is-focused) ;; Superare il labirinto rende Pipo piu concentrato
    )
  )

  ;; Azione per resistere alla Melodia Malinconica
  (:action resist-sad-melody
    :parameters (?p - pipo ?l - luogo) ;; Pipo resiste alla melodia in un certo luogo
    :precondition (and
      (at ?p ?l) ;; Pipo deve essere nel luogo affetto dalla melodia
      (melody-is-sad) ;; La melodia deve essere attiva
      (pipo-is-focused) ;; Pipo deve essere concentrato per resistere (dopo il labirinto)
    )
    :effect (and
      (not (melody-is-sad)) ;; La melodia non e piu attiva
    )
  )

  ;; Azione per sventare il sabotaggio del Mimo Silente
  (:action outsmart-mime
    :parameters (?p - pipo ?l - luogo) ;; Pipo sventa il piano del mimo
    :precondition (and
      (at ?p ?l) ;; Pipo deve essere dove il mimo sta agendo
      (mime-is-sabotaging) ;; Il mimo deve essere in modalita sabotaggio
    )
    :effect (and
      (not (mime-is-sabotaging)) ;; Il mimo non sta piu sabotando
    )
  )

  ;; Azione per raccogliere il Fiore che Ride
  (:action get-laughing-flower
    :parameters (?p - pipo ?f - fiore ?l - luogo) ;; Pipo raccoglie il fiore
    :precondition (and
      (at ?p ?l) ;; Pipo deve essere nella stessa location del fiore
      (flower-at ?f ?l) ;; Il fiore deve essere in quella location
      (not (pipo-has-flower ?f)) ;; Pipo non deve gia avere il fiore
    )
    :effect (and
      (pipo-has-flower ?f) ;; Pipo ora possiede il fiore
      (not (flower-at ?f ?l)) ;; Il fiore non e piu in quella location
    )
  )

  ;; Azione finale per usare il fiore e salvare il circo
  (:action restore-circus-joy
    :parameters (?p - pipo ?f - fiore ?l-circus - luogo) ;; Pipo usa il fiore al circo
    :precondition (and
      (at ?p ?l-circus) ;; Pipo deve essere tornato al circo
      (pipo-has-flower ?f) ;; Pipo deve avere il fiore
      (pipo-has-lost-touch) ;; Il problema iniziale deve essere ancora presente
    )
    :effect (and
      (not (pipo-has-lost-touch)) ;; Pipo ritrova il suo tocco comico
      (circus-is-saved) ;; Il circo e salvo, raggiungendo l'obiettivo finale
    )
  )
)

; problem
;; problem.pddl
;; File di problema per la quest "Il Sorriso Perduto di Pipo".
;; Definisce lo stato iniziale del mondo e l'obiettivo finale della missione.

(define (problem ritrovare-il-sorriso-di-pipo)
  (:domain sorriso-perduto-di-pipo) ;; Specifica il dominio di riferimento per questo problema

  ;; --- OGGETTI ---
  ;; Definizione degli oggetti specifici presenti in questa istanza del mondo.
  (:objects
    pipo1 - pipo ;; Il nostro eroe, il pagliaccio Pipo
    fiore-che-ride - fiore ;; L'oggetto magico da recuperare

    circus-aeturnum - luogo ;; Il punto di partenza e di arrivo della quest
    ponte-caramello - luogo ;; Il luogo dove si trova il Guardiano Brontolone
    labirinto-specchi - luogo ;; Il luogo dove si trova il labirinto e il mimo
    foresta-sussurrante - luogo ;; Il luogo dove si trova il fiore e la melodia
  )

  ;; --- STATO INIZIALE ---
  ;; Descrizione dello stato del mondo all'inizio della quest.
  (:init
    ;; Posizioni iniziali dei personaggi e degli oggetti
    (at pipo1 circus-aeturnum) ;; Pipo parte dal tendone del circo
    (flower-at fiore-che-ride foresta-sussurrante) ;; Il Fiore che Ride si trova nella foresta

    ;; Stato iniziale di Pipo e del circo
    (pipo-has-lost-touch) ;; Pipo ha perso la sua comicita, il problema principale

    ;; Ostacoli attivi nel mondo
    (guardian-blocks-bridge) ;; Il Guardiano Brontolone blocca il passaggio sul ponte
    (labyrinth-is-confusing) ;; Il labirinto degli specchi e un ostacolo attivo
    (mime-is-sabotaging) ;; Il Mimo Silente sta attivamente sabotando la missione
    (melody-is-sad) ;; La Melodia Malinconica e attiva e induce tristezza

    ;; Definizione dei percorsi percorribili tra i luoghi
    (path-is-clear circus-aeturnum ponte-caramello) ;; Si puo viaggiare dal circo al ponte
    (path-is-clear ponte-caramello circus-aeturnum) ;; Si puo tornare dal ponte al circo
    (path-is-clear ponte-caramello labirinto-specchi) ;; Si puo viaggiare dal ponte al labirinto
    (path-is-clear labirinto-specchi ponte-caramello) ;; Si puo tornare dal labirinto al ponte
    (path-is-clear labirinto-specchi foresta-sussurrante) ;; Si puo viaggiare dal labirinto alla foresta
    (path-is-clear foresta-sussurrante labirinto-specchi) ;; Si puo tornare dalla foresta al labirinto
  )

  ;; --- OBIETTIVO ---
  ;; Le condizioni che devono essere vere per considerare il problema risolto.
  (:goal (and
    (circus-is-saved) ;; L'obiettivo finale e salvare il Circus Aeturnum
  ))
)

; plan
1. (move pipo1 circus-aeturnum ponte-caramello)
   deleted: (at pipo1 circus-aeturnum)
   added: (at pipo1 ponte-caramello)
   goals met: 0 of 1
2. (move pipo1 ponte-caramello labirinto-specchi)
   deleted: (at pipo1 ponte-caramello)
   added: (at pipo1 labirinto-specchi)
   goals met: 0 of 1
3. (move pipo1 labirinto-specchi foresta-sussurrante)
   deleted: (at pipo1 labirinto-specchi)
   added: (at pipo1 foresta-sussurrante)
   goals met: 0 of 1
4. (get-laughing-flower pipo1 fiore-che-ride foresta-sussurrante)
   deleted: (flower-at fiore-che-ride foresta-sussurrante)
   added: (pipo-has-flower fiore-che-ride)
   goals met: 0 of 1
5. (restore-circus-joy pipo1 fiore-che-ride foresta-sussurrante)
   deleted: (pipo-has-lost-touch)
   added: (circus-is-saved)
   goals met: 1 of 1
